           03 rectl.
            05 rectl-xleft                      pic s9(9) comp-5.
            05 rectl-ybottom                    pic s9(9) comp-5.
            05 rectl-xright                     pic s9(9) comp-5.
            05 rectl-ytop                       pic s9(9) comp-5.
